wrk/result100_index.out
Running 1m test @ http://host.docker.internal:3000/search-test
  1 threads and 100 connections
  Thread calibration: mean lat.: 3265.754ms, rate sampling interval: 13664ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.34s    12.00s    0.91m    59.42%
    Req/Sec    17.00      0.00    17.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.43s 
 75.000%   36.86s 
 90.000%   43.55s 
 99.000%    0.86m 
 99.900%    0.90m 
 99.990%    0.91m 
 99.999%    0.91m 
100.000%    0.91m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2187.263     0.000000            1         1.00
   11182.079     0.100000           84         1.11
   14966.783     0.200000          167         1.25
   19415.039     0.300000          250         1.43
   23052.287     0.400000          334         1.67
   27426.815     0.500000          418         2.00
   29147.135     0.550000          459         2.22
   31358.975     0.600000          500         2.50
   33374.207     0.650000          542         2.86
   35094.527     0.700000          584         3.33
   36863.999     0.750000          625         4.00
   37912.575     0.775000          646         4.44
   38895.615     0.800000          668         5.00
   40370.175     0.825000          689         5.71
   41451.519     0.850000          709         6.67
   42401.791     0.875000          729         8.00
   42860.543     0.887500          741         8.89
   43548.671     0.900000          750        10.00
   44007.423     0.912500          763        11.43
   44531.711     0.925000          771        13.33
   45809.663     0.937500          781        16.00
   46268.415     0.943750          787        17.78
   46399.487     0.950000          792        20.00
   46956.543     0.956250          797        22.86
   47349.759     0.962500          802        26.67
   47906.815     0.968750          807        32.00
   48955.391     0.971875          810        35.56
   49250.303     0.975000          813        40.00
   49905.663     0.978125          815        45.71
   50266.111     0.981250          818        53.33
   51052.543     0.984375          820        64.00
   51150.847     0.985938          822        71.11
   51183.615     0.987500          823        80.00
   51249.151     0.989062          824        91.43
   52068.351     0.990625          826       106.67
   52232.191     0.992188          827       128.00
   52494.335     0.992969          828       142.22
   52494.335     0.993750          828       160.00
   53051.391     0.994531          829       182.86
   53411.839     0.995313          830       213.33
   53411.839     0.996094          830       256.00
   53477.375     0.996484          831       284.44
   53477.375     0.996875          831       320.00
   53477.375     0.997266          831       365.71
   54263.807     0.997656          832       426.67
   54263.807     0.998047          832       512.00
   54263.807     0.998242          832       568.89
   54263.807     0.998437          832       640.00
   54263.807     0.998633          832       731.43
   54722.559     0.998828          833       853.33
   54722.559     1.000000          833          inf
#[Mean    =    27342.753, StdDeviation   =    11996.300]
#[Max     =    54689.792, Total count    =          833]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1088 requests in 1.00m, 292.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 2132
Requests/sec:     18.06
Transfer/sec:      4.86MB