wrk/result10_index.out
Running 1m test @ http://host.docker.internal:3000/search-test
  1 threads and 10 connections
  Thread calibration: mean lat.: 309.794ms, rate sampling interval: 1141ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   412.03ms  593.54ms   3.68s    90.36%
    Req/Sec     9.42      2.28    17.00     86.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  211.07ms
 75.000%  460.80ms
 90.000%  915.46ms
 99.000%    2.74s 
 99.900%    3.68s 
 99.990%    3.68s 
 99.999%    3.68s 
100.000%    3.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.759     0.000000            1         1.00
      22.463     0.100000           50         1.11
      47.007     0.200000          100         1.25
      82.879     0.300000          150         1.43
     139.263     0.400000          201         1.67
     211.071     0.500000          249         2.00
     248.703     0.550000          274         2.22
     293.631     0.600000          300         2.50
     346.111     0.650000          324         2.86
     387.839     0.700000          349         3.33
     460.799     0.750000          374         4.00
     487.935     0.775000          386         4.44
     530.943     0.800000          399         5.00
     576.511     0.825000          411         5.71
     657.919     0.850000          425         6.67
     783.871     0.875000          436         8.00
     850.943     0.887500          442         8.89
     935.935     0.900000          449        10.00
    1310.719     0.912500          455        11.43
    1479.679     0.925000          461        13.33
    1665.023     0.937500          467        16.00
    1756.159     0.943750          470        17.78
    1899.519     0.950000          474        20.00
    2043.903     0.956250          477        22.86
    2179.071     0.962500          480        26.67
    2312.191     0.968750          483        32.00
    2316.287     0.971875          484        35.56
    2342.911     0.975000          486        40.00
    2590.719     0.978125          488        45.71
    2621.439     0.981250          489        53.33
    2705.407     0.984375          491        64.00
    2705.407     0.985938          491        71.11
    2713.599     0.987500          492        80.00
    2740.223     0.989062          493        91.43
    2838.527     0.990625          494       106.67
    2949.119     0.992188          495       128.00
    2949.119     0.992969          495       142.22
    2949.119     0.993750          495       160.00
    2973.695     0.994531          496       182.86
    2973.695     0.995313          496       213.33
    3123.199     0.996094          497       256.00
    3123.199     0.996484          497       284.44
    3123.199     0.996875          497       320.00
    3123.199     0.997266          497       365.71
    3123.199     0.997656          497       426.67
    3678.207     0.998047          498       512.00
    3678.207     1.000000          498          inf
#[Mean    =      412.031, StdDeviation   =      593.537]
#[Max     =     3676.160, Total count    =          498]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  598 requests in 1.00m, 177.45MB read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:      9.96
Transfer/sec:      2.95MB