wrk/result1_index.out
Running 1m test @ http://host.docker.internal:3000/search-test
  1 threads and 1 connections
  Thread calibration: mean lat.: 82.392ms, rate sampling interval: 384ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    94.39ms  181.87ms   1.27s    94.00%
    Req/Sec     0.78      1.03     5.00     99.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   46.30ms
 75.000%   86.97ms
 90.000%  127.29ms
 99.000%    1.27s 
 99.900%    1.27s 
 99.990%    1.27s 
 99.999%    1.27s 
100.000%    1.27s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.655     0.000000            1         1.00
      11.839     0.100000            5         1.11
      28.143     0.200000           10         1.25
      31.199     0.300000           15         1.43
      38.911     0.400000           20         1.67
      46.303     0.500000           25         2.00
      53.439     0.550000           28         2.22
      64.287     0.600000           30         2.50
      75.391     0.650000           33         2.86
      78.335     0.700000           36         3.33
      86.975     0.750000           38         4.00
      92.479     0.775000           39         4.44
      93.311     0.800000           40         5.00
     104.447     0.825000           42         5.71
     117.183     0.850000           43         6.67
     122.047     0.875000           44         8.00
     127.295     0.887500           45         8.89
     127.295     0.900000           45        10.00
     255.231     0.912500           46        11.43
     267.519     0.925000           47        13.33
     267.519     0.937500           47        16.00
     286.719     0.943750           48        17.78
     286.719     0.950000           48        20.00
     286.719     0.956250           48        22.86
     305.663     0.962500           49        26.67
     305.663     0.968750           49        32.00
     305.663     0.971875           49        35.56
     305.663     0.975000           49        40.00
     305.663     0.978125           49        45.71
    1272.831     0.981250           50        53.33
    1272.831     1.000000           50          inf
#[Mean    =       94.385, StdDeviation   =      181.873]
#[Max     =     1271.808, Total count    =           50]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60 requests in 1.00m, 17.64MB read
Requests/sec:      1.00
Transfer/sec:    300.95KB